Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: وإن كنتم على سفر ولم تجدوا كاتبا فرهان مقبوضة فإن أمن بعضكم بعضا فليؤد الذي اؤتمن أمانته وليتق الله ربه ولا تكتموا الشهادة ومن يكتمها فإنه آثم قلبه والله بما تعملون عليم
en: And if you are on a journey and cannot find a scribe, then let there be a pledge taken (mortgaging) ; then if one of you entrust the other, let the one who is entrusted discharge his trust (faithfully), and let him be afraid of Allah, his Lord. And conceal not the evidence for he, who hides it, surely his heart is sinful. And Allah is All-Knower of what you do.

source: لله ما في السماوات وما في الأرض وإن تبدوا ما في أنفسكم أو تخفوه يحاسبكم به الله فيغفر لمن يشاء ويعذب من يشاء والله على كل شيء قدير
en: To Allah belongs all that is in the heavens and all that is on the earth, and whether you disclose what is in your ownselves or conceal it, Allah will call you to account for it. Then He forgives whom He wills and punishes whom He wills. And Allah is Able to do all things.

source: آمن الرسول بما أنزل إليه من ربه والمؤمنون كل آمن بالله وملائكته وكتبه ورسله لا نفرق بين أحد من رسله وقالوا سمعنا وأطعنا غفرانك ربنا وإليك المصير
en: The Messenger (Muhammad صلى الله عليه وسلم) believes in what has been sent down to him from his Lord, and (so do) the believers. Each one believes in Allah, His Angels, His Books, and His Messengers. (They say), "We make no distinction between one another of His Messengers" - and they say, "We hear, and we obey. (We seek) Your Forgiveness, our Lord, and to You is the return (of all)."

source: لا يكلف الله نفسا إلا وسعها لها ما كسبت وعليها ما اكتسبت ربنا لا تؤاخذنا إن نسينا أو أخطأنا ربنا ولا تحمل علينا إصرا كما حملته على الذين من قبلنا ربنا ولا تحملنا ما لا طاقة لنا به واعف عنا واغفر لنا وارحمنا أنت مولانا فانصرنا على القوم الكافرين
en: Allah burdens not a person beyond his scope. He gets reward for that (good) which he has earned, and he is punished for that (evil) which he has earned. "Our Lord! Punish us not if we forget or fall into error, our Lord! Lay not on us a burden like that which You did lay on those before us (Jews and Christians); our Lord! Put not on us a burden greater than we have strength to bear. Pardon us and grant us Forgiveness. Have mercy on us. You are our Maula (Patron, Supporter and Protector, etc.) and give us victory over the disbelieving people. "

source: الله لا إله إلا هو الحي القيوم
en: Allah! La ilaha illa Huwa (none has the right to be worshipped but He), Al-Hayyul-Qayyum (the Ever Living, the One Who sustains and protects all that exists).

source: نزل عليك الكتاب بالحق مصدقا لما بين يديه وأنزل التوراة والإنجيل
en: It is He Who has sent down the Book (the Qur'an) to you (O Muhammad صلى الله عليه وسلم) with truth, confirming what came before it. And He sent down the Taurat (Torah) and the Injeel (Gospel),

source: من قبل هدى للناس وأنزل الفرقان إن الذين كفروا بآيات الله لهم عذاب شديد والله عزيز ذو انتقام
en: Aforetime, as a guidance to mankind. And He sent down the criterion [of judgement between right and wrong (this Qur'an)]. Truly, those who disbelieve in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, for them there is a severe torment; and Allah is All-Mighty, All-Able of Retribution.

source: إن الله لا يخفى عليه شيء في الأرض ولا في السماء
en: Truly, nothing is hidden from Allah, in the earth or in the heaven.

source: هو الذي يصوركم في الأرحام كيف يشاء لا إله إلا هو العزيز الحكيم
en: He it is Who shapes you in the wombs as He wills. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise.

source: هو الذي أنزل عليك الكتاب منه آيات محكمات هن أم الكتاب وأخر متشابهات فأما الذين في قلوبهم زيغ فيتبعون ما تشابه منه ابتغاء الفتنة وابتغاء تأويله وما يعلم تأويله إلا الله والراسخون في العلم يقولون آمنا به كل من عند ربنا وما يذكر إلا أولو الألباب
en: It is He Who has sent down to you (Muhammad صلى الله عليه وسلم) the Book (this Qur'an). In it are Verses that are entirely clear, they are the foundations of the Book [and those are the Verses of Al-Ahkam (commandments), Al-Fara'id (obligatory duties) and Al-Hudud (legal laws for the punishment of thieves, adulterers)]; and others not entirely clear. So as for those in whose hearts there is a deviation (from the truth) they follow that which is not entirely clear thereof, seeking Al-Fitnah (polytheism and trials), and seeking for its hidden meanings, but none knows its hidden meanings save Allah. And those who are firmly grounded in knowledge say: "We believe in it; the whole of it (clear and unclear Verses) are from our Lord." And none receive admonition except men of understanding. (Tafsir At-Tabari).

source: ربنا لا تزغ قلوبنا بعد إذ هديتنا وهب لنا من لدنك رحمة إنك أنت الوهاب
en: (They say): "Our Lord! Let not our hearts deviate (from the truth) after You have guided us, and grant us mercy from You. Truly, You are the Bestower."

source: ربنا إنك جامع الناس ليوم لا ريب فيه إن الله لا يخلف الميعاد
en: "Our Lord! Verily, it is You Who will gather mankind together on the Day about which there is no doubt. Verily, Allah never breaks His Promise".

source: إن الذين كفروا لن تغني عنهم أموالهم ولا أولادهم من الله شيئا وأولئك هم وقود النار
en: Verily, those who disbelieve, neither their properties nor their offspring will avail them whatsoever against Allah; and it is they who will be fuel of the Fire.

source: كدأب آل فرعون والذين من قبلهم كذبوا بآياتنا فأخذهم الله بذنوبهم والله شديد العقاب
en: Like the behaviour of the people of Fir'aun (Pharaoh) and those before them; they belied Our Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.). So Allah seized (destroyed) them for their sins. And Allah is Severe in punishment.

source: قل للذين كفروا ستغلبون وتحشرون إلى جهنم وبئس المهاد
en: Say (O Muhammad صلى الله عليه وسلم) to those who disbelieve: "You will be defeated and gathered together to Hell, and worst indeed is that place to rest."

source: قد كان لكم آية في فئتين التقتا فئة تقاتل في سبيل الله وأخرى كافرة يرونهم مثليهم رأي العين والله يؤيد بنصره من يشاء إن في ذلك لعبرة لأولي الأبصار
en: There has already been a sign for you (O Jews) in the two armies that met (in combat i.e. the battle of Badr). One was fighting in the Cause of Allah, and as for the other, (they) were disbelievers. They (the believers) saw them (the disbelievers) with their own eyes twice their number (although they were thrice their number). And Allah supports with His Victory whom He wills. Verily, in this is a lesson for those who understand. (See Verse 8:44). (Tafsir At-Tabari)

source: زين للناس حب الشهوات من النساء والبنين والقناطير المقنطرة من الذهب والفضة والخيل المسومة والأنعام والحرث ذلك متاع الحياة الدنيا والله عنده حسن المآب
en: Beautified for men is the love of things they covet; women, children, much of gold and silver (wealth), branded beautiful horses, cattle and well-tilled land. This is the pleasure of the present world's life; but Allah has the excellent return (Paradise with flowing rivers) with Him.

source: قل أؤنبئكم بخير من ذلكم للذين اتقوا عند ربهم جنات تجري من تحتها الأنهار خالدين فيها وأزواج مطهرة ورضوان من الله والله بصير بالعباد
en: Say: "Shall I inform you of things far better than those? For Al-Muttaqun (the pious - See V.2:2) there are Gardens (Paradise) with their Lord, underneath which rivers flow. Therein (is their) eternal (home) and Azwajun Mutahharatun (purified mates or wives). And Allah will be pleased with them. And Allah is All-Seer of the (His) slaves".

source: الذين يقولون ربنا إننا آمنا فاغفر لنا ذنوبنا وقنا عذاب النار
en: Those who say: "Our Lord! We have indeed believed, so forgive us our sins and save us from the punishment of the Fire."

source: الصابرين والصادقين والقانتين والمنفقين والمستغفرين بالأسحار
en: (They are) those who are patient, those who are true (in Faith, words, and deeds), and obedient with sincere devotion in worship to Allah. Those who spend [give the Zakat and alms in the Way of Allah] and those who pray and beg Allah's Pardon in the last hours of the night.

source: شهد الله أنه لا إله إلا هو والملائكة وأولو العلم قائما بالقسط لا إله إلا هو العزيز الحكيم
en: Allah bears witness that La ilaha illa Huwa (none has the right to be worshipped but He), and the angels, and those having knowledge (also give this witness); (He always) maintains His creation in Justice. La ilaha illa Huwa (none has the right to be worshipped but He), the All-Mighty, the All-Wise.

source: إن الدين عند الله الإسلام وما اختلف الذين أوتوا الكتاب إلا من بعد ما جاءهم العلم بغيا بينهم ومن يكفر بآيات الله فإن الله سريع الحساب
en: Truly, the religion with Allah is Islam. Those who were given the Scripture (Jews and Christians) did not differ except, out of mutual jealousy, after knowledge had come to them. And whoever disbelieves in the Ayat (proofs, evidence, verses, signs, revelations, etc.) of Allah, then surely, Allah is Swift in calling to account.

source: فإن حاجوك فقل أسلمت وجهي لله ومن اتبعن وقل للذين أوتوا الكتاب والأميين أأسلمتم فإن أسلموا فقد اهتدوا وإن تولوا فإنما عليك البلاغ والله بصير بالعباد
en: So if they dispute with you (Muhammad صلى الله عليه وسلم) say: "I have submitted myself to Allah (in Islam), and (so have) those who follow me." And say to those who were given the Scripture (Jews and Christians) and to those who are illiterates (Arab pagans): "Do you (also) submit yourselves (to Allah in Islam)?" If they do, they are rightly guided; but if they turn away, your duty is only to convey the Message; and Allah is All-Seer of (His) slaves .

source: إن الذين يكفرون بآيات الله ويقتلون النبيين بغير حق ويقتلون الذين يأمرون بالقسط من الناس فبشرهم بعذاب أليم
en: Verily! Those who disbelieve in the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah and kill the Prophets without right, and kill those men who order just dealings, ... then announce to them a painful torment.

source: أولئك الذين حبطت أعمالهم في الدنيا والآخرة وما لهم من ناصرين
en: They are those whose works will be lost in this world and in the Hereafter, and they will have no helpers.

source: ألم تر إلى الذين أوتوا نصيبا من الكتاب يدعون إلى كتاب الله ليحكم بينهم ثم يتولى فريق منهم وهم معرضون
en: Have you not seen those who have been given a portion of the Scripture? They are being invited to the Book of Allah to settle their dispute, then a party of them turn away, and they are averse.

source: ذلك بأنهم قالوا لن تمسنا النار إلا أياما معدودات وغرهم في دينهم ما كانوا يفترون
en: This is because they say: "The Fire shall not touch us but for a number of days." And that which they used to invent regarding their religion has deceived them.

source: فكيف إذا جمعناهم ليوم لا ريب فيه ووفيت كل نفس ما كسبت وهم لا يظلمون
en: How (will it be) when We gather them together on the Day about which there is no doubt (i.e. the Day of Resurrection). And each person will be paid in full what he has earned? And they will not be dealt with unjustly.

source: قل اللهم مالك الملك تؤتي الملك من تشاء وتنزع الملك ممن تشاء وتعز من تشاء وتذل من تشاء بيدك الخير إنك على كل شيء قدير
en: Say (O Muhammad صلى الله عليه وسلم): "O Allah! Possessor of the kingdom, You give the kingdom to whom You will, and You take the kingdom from whom You will, and You endue with honour whom You will, and You humiliate whom You will. In Your Hand is the good. Verily, You are Able to do all things.

source: تولج الليل في النهار وتولج النهار في الليل وتخرج الحي من الميت وتخرج الميت من الحي وترزق من تشاء بغير حساب
en: You make the night to enter into the day, and You make the day to enter into the night (i.e. increase and decrease in the hours of the night and the day during winter and summer), You bring the living out of the dead, and You bring the dead out of the living. And You give wealth and sustenance to whom You will, without limit (measure or account).

source: لا يتخذ المؤمنون الكافرين أولياء من دون المؤمنين ومن يفعل ذلك فليس من الله في شيء إلا أن تتقوا منهم تقاة ويحذركم الله نفسه وإلى الله المصير
en: Let not the believers take the disbelievers as Auliya (supporters, helpers) instead of the believers, and whoever does that will never be helped by Allah in any way, except if you indeed fear a danger from them. And Allah warns you against Himself (His punishment) , and to Allah is the final return.

source: قل إن تخفوا ما في صدوركم أو تبدوه يعلمه الله ويعلم ما في السماوات وما في الأرض والله على كل شيء قدير
en: Say (O Muhammad صلى الله عليه وسلم): "Whether you hide what is in your breasts or reveal it, Allah knows it, and He knows what is in the heavens and what is in the earth. And Allah is Able to do all things."

source: يوم تجد كل نفس ما عملت من خير محضرا وما عملت من سوء تود لو أن بينها وبينه أمدا بعيدا ويحذركم الله نفسه والله رءوف بالعباد
en: On the Day when every person will be confronted with all the good he has done, and all the evil he has done, he will wish that there were a great distance between him and his evil. And Allah warns you against Himself (His punishment) and Allah is full of kindness to (His) slaves.

source: قل إن كنتم تحبون الله فاتبعوني يحببكم الله ويغفر لكم ذنوبكم والله غفور رحيم
en: Say (O Muhammad صلى الله عليه وسلم to mankind): "If you (really) love Allah then follow me (i.e. accept Islamic Monotheism, follow the Qur'an and the Sunnah), Allah will love you and forgive you your sins. And Allah is Oft-Forgiving, Most Merciful."

source: قل أطيعوا الله والرسول فإن تولوا فإن الله لا يحب الكافرين
en: Say (O Muhammad صلى الله عليه وسلم): "Obey Allah and the Messenger (Muhammad صلى الله عليه وسلم)." But if they turn away, then Allah does not like the disbelievers .

source: إن الله اصطفى آدم ونوحا وآل إبراهيم وآل عمران على العالمين
en: Allah chose Adam, Nuh (Noah), the family of Ibrahim (Abraham) and the family of 'Imran above the 'Alamin (mankind and jinn) (of their times).

source: ذرية بعضها من بعض والله سميع عليم
en: Offspring, one of the other, and Allah is All-Hearer, All-Knower.

source: إذ قالت امرأت عمران رب إني نذرت لك ما في بطني محررا فتقبل مني إنك أنت السميع العليم
en: (Remember) when the wife of 'Imran said: "O my Lord! I have vowed to You what (the child that) is in my womb to be dedicated for Your services (free from all worldly work; to serve Your Place of worship), so accept this from me. Verily, You are the All-Hearer, the All-Knowing."

source: فلما وضعتها قالت رب إني وضعتها أنثى والله أعلم بما وضعت وليس الذكر كالأنثى وإني سميتها مريم وإني أعيذها بك وذريتها من الشيطان الرجيم
en: Then when she gave birth to her [child Maryam (Mary)], she said: "O my Lord! I have given birth to a female child," - and Allah knew better what she brought forth, - "And the male is not like the female, and I have named her Maryam (Mary), and I seek refuge with You (Allah) for her and for her offspring from Shaitan (Satan), the outcast."

source: فتقبلها ربها بقبول حسن وأنبتها نباتا حسنا وكفلها زكريا كلما دخل عليها زكريا المحراب وجد عندها رزقا قال يا مريم أنى لك هذا قالت هو من عند الله إن الله يرزق من يشاء بغير حساب
en: So her Lord (Allah) accepted her with goodly acceptance. He made her grow in a good manner and put her under the care of Zakariya (Zachariya). Every time he entered Al-Mihrab to (visit) her, he found her supplied with sustenance. He said: "O Maryam (Mary)! From where have you got this?" She said, "This is from Allah." Verily, Allah provides sustenance to whom He wills, without limit."

source: هنالك دعا زكريا ربه قال رب هب لي من لدنك ذرية طيبة إنك سميع الدعاء
en: At that time Zakariya (Zachariya) invoked his Lord, saying: "O my Lord! Grant me from You, a good offspring. You are indeed the All-Hearer of invocation."

source: فنادته الملائكة وهو قائم يصلي في المحراب أن الله يبشرك بيحيى مصدقا بكلمة من الله وسيدا وحصورا ونبيا من الصالحين
en: Then the angels called him, while he was standing in prayer in Al-Mihrab (a praying place or a private room), (saying): "Allah gives you glad tidings of Yahya (John), confirming (believing in) the word from Allah [i.e. the creation of 'Îsa (Jesus) عليه السلام, the Word from Allah ("Be!" - and he was!)], noble, keeping away from sexual relations with women, a Prophet, from among the righteous."

source: قال رب أنى يكون لي غلام وقد بلغني الكبر وامرأتي عاقر قال كذلك الله يفعل ما يشاء
en: He said: "O my Lord! How can I have a son when I am very old, and my wife is barren?" (Allah) said: "Thus Allah does what He wills."

source: قال رب اجعل لي آية قال آيتك ألا تكلم الناس ثلاثة أيام إلا رمزا واذكر ربك كثيرا وسبح بالعشي والإبكار
en: He said: "O my Lord! Make a sign for me." Allah said: "Your sign is that you shall not speak to mankind for three days except with signals. And remember your Lord much (by praising Him again and again), and glorify (Him) in the afternoon and in the morning. "

source: وإذ قالت الملائكة يا مريم إن الله اصطفاك وطهرك واصطفاك على نساء العالمين
en: And (remember) when the angels said: "O Maryam (Mary)! Verily, Allah has chosen you, purified you (from polytheism and disbelief), and chosen you above the women of the 'Alamin (mankind and jinn) (of her lifetime)."

source: يا مريم اقنتي لربك واسجدي واركعي مع الراكعين
en: O Mary! "Submit yourself with obedience to your Lord (Allah, by worshipping none but Him Alone) and prostrate yourself, and Irka'i (bow down) along with Ar-Raki'un (those who bow down)."

source: ذلك من أنباء الغيب نوحيه إليك وما كنت لديهم إذ يلقون أقلامهم أيهم يكفل مريم وما كنت لديهم إذ يختصمون
en: This is a part of the news of the Ghaib (unseen, i.e. the news of the past nations of which you have no knowledge) which We reveal to you (O Muhammad صلى الله عليه وسلم). You were not with them, when they cast lots with their pens as to which of them should be charged with the care of Maryam (Mary); nor were you with them when they disputed.

source: إذ قالت الملائكة يا مريم إن الله يبشرك بكلمة منه اسمه المسيح عيسى ابن مريم وجيها في الدنيا والآخرة ومن المقربين
en: (Remember) when the angels said: "O Maryam (Mary)! Verily, Allah gives you the glad tidings of a Word ["Be!" - and he was! i.e. 'Îsa (Jesus) the son of Maryam (Mary)] from Him, his name will be the Messiah 'Îsa (Jesus), the son of Maryam (Mary), held in honour in this world and in the Hereafter, and will be one of those who are near to Allah."

source: ويكلم الناس في المهد وكهلا ومن الصالحين
en: "He will speak to the people in the cradle and in manhood, and he will be one of the righteous."

source: قالت رب أنى يكون لي ولد ولم يمسسني بشر قال كذلك الله يخلق ما يشاء إذا قضى أمرا فإنما يقول له كن فيكون
en: She said: "O my Lord! How shall I have a son when no man has touched me." He said: "So (it will be) for Allah creates what He wills. When He has decreed something, He says to it only: "Be!" - and it is.

source: ويعلمه الكتاب والحكمة والتوراة والإنجيل
en: And He (Allah) will teach him [('Îsa (Jesus)] the Book and Al-Hikmah (i.e. the Sunnah, the faultless speech of the Prophets, wisdom), (and) the Taurat (Torah) and the Injeel (Gospel).

source: ورسولا إلى بني إسرائيل أني قد جئتكم بآية من ربكم أني أخلق لكم من الطين كهيئة الطير فأنفخ فيه فيكون طيرا بإذن الله وأبرئ الأكمه والأبرص وأحيي الموتى بإذن الله وأنبئكم بما تأكلون وما تدخرون في بيوتكم إن في ذلك لآية لكم إن كنتم مؤمنين
en: And will make him [('Îsa (Jesus)] a Messenger to the Children of Israel (saying): "I have come to you with a sign from your Lord, that I design for you out of clay, a figure like that of a bird, and breathe into it, and it becomes a bird by Allah's Leave; and I heal him who was born blind, and the leper, and I bring the dead to life by Allah's Leave. And I inform you of what you eat, and what you store in your houses. Surely, therein is a sign for you, if you believe.

source: ومصدقا لما بين يدي من التوراة ولأحل لكم بعض الذي حرم عليكم وجئتكم بآية من ربكم فاتقوا الله وأطيعون
en: And I have come confirming that which was before me of the Taurat (Torah), and to make lawful to you part of what was forbidden to you, and I have come to you with a proof from your Lord. So fear Allah and obey me.

source: إن الله ربي وربكم فاعبدوه هذا صراط مستقيم
en: Truly! Allah is my Lord and your Lord, so worship Him (Alone). This is the Straight Path.

source: فلما أحس عيسى منهم الكفر قال من أنصاري إلى الله قال الحواريون نحن أنصار الله آمنا بالله واشهد بأنا مسلمون
en: Then when 'Îsa (Jesus) came to know of their disbelief, he said: "Who will be my helpers in Allah's Cause?" Al-Hawariyyun (the disciples) said: "We are the helpers of Allah; we believe in Allah, and bear witness that we are Muslims (i.e. we submit to Allah)."

source: ربنا آمنا بما أنزلت واتبعنا الرسول فاكتبنا مع الشاهدين
en: Our Lord! We believe in what You have sent down, and we follow the Messenger [('Îsa (Jesus)]; so write us down among those who bear witness (to the truth i.e. La ilaha illallah - none has the right to be worshipped but Allah).

source: ومكروا ومكر الله والله خير الماكرين
en: And they (disbelievers) plotted to kill 'Îsa [(Jesus) عليه السلام], and Allah plotted too. And Allah is the Best of those who plot.

source: إذ قال الله يا عيسى إني متوفيك ورافعك إلي ومطهرك من الذين كفروا وجاعل الذين اتبعوك فوق الذين كفروا إلى يوم القيامة ثم إلي مرجعكم فأحكم بينكم فيما كنتم فيه تختلفون
en: And (remember) when Allah said: "O 'Îsa (Jesus)! I will take you and raise you to Myself and clear you [of the forged statement that 'Îsa (Jesus) is Allah's son] of those who disbelieve, and I will make those who follow you (Monotheists, who worship none but Allah) superior to those who disbelieve [in the Oneness of Allah, or disbelieve in some of His Messengers, e.g. Muhammad صلى الله عليه وسلم, 'Îsa (Jesus), Musa (Moses), etc., or in His Holy Books, e.g. the Taurat (Torah), the Injeel (Gospel), the Qur'an] till the Day of Resurrection . Then you will return to Me and I will judge between you in the matters in which you used to dispute."

source: فأما الذين كفروا فأعذبهم عذابا شديدا في الدنيا والآخرة وما لهم من ناصرين
en: "As to those who disbelieve, I will punish them with a severe torment in this world and in the Hereafter, and they will have no helpers."

source: وأما الذين آمنوا وعملوا الصالحات فيوفيهم أجورهم والله لا يحب الظالمين
en: And as for those who believe (in the Oneness of Allah) and do righteous good deeds, Allah will pay them their reward in full. And Allah does not like the Zalimun (polytheists and wrong-doers).

source: ذلك نتلوه عليك من الآيات والذكر الحكيم
en: This is what We recite to you (O Muhammad صلى الله عليه وسلم) of the Verses and the Wise Reminder (i.e. the Qur'an).

source: إن مثل عيسى عند الله كمثل آدم خلقه من تراب ثم قال له كن فيكون
en: Verily, the likeness of 'Îsa (Jesus) before Allah is the likeness of Adam. He created him from dust, then (He) said to him: "Be!" - and he was.

source: الحق من ربك فلا تكن من الممترين
en: (This is) the truth from your Lord, so be not of those who doubt.

source: فمن حاجك فيه من بعد ما جاءك من العلم فقل تعالوا ندع أبناءنا وأبناءكم ونساءنا ونساءكم وأنفسنا وأنفسكم ثم نبتهل فنجعل لعنت الله على الكاذبين
en: Then whoever disputes with you concerning him ['Îsa (Jesus)] after (all this) knowledge that has come to you [i.e. 'Îsa (Jesus) being a slave of Allah, and having no share in Divinity], say: (O Muhammad صلى الله عليه وسلم) "Come, let us call our sons and your sons, our women and your women, ourselves and yourselves - then we pray and invoke (sincerely) the Curse of Allah upon those who lie."

source: إن هذا لهو القصص الحق وما من إله إلا الله وإن الله لهو العزيز الحكيم
en: Verily! This is the true narrative [about the story of 'Îsa (Jesus)], and La ilaha illallah (none has the right to be worshipped but Allah, the One and the Only True God, Who has neither a wife nor a son). And indeed, Allah is the All-Mighty, the All-Wise.

source: فإن تولوا فإن الله عليم بالمفسدين
en: And if they turn away (and do not accept these true proofs and evidence), then surely, Allah is All-Aware of those who do mischief.
